# Discussion 05 Notebook

This notebook is an accompaniment to the associated discussion worksheet handout.

# Section II. Data Model Concepts

## Question 9

Consider the following dataframe.

In [1]:
import pandas as pd
data_q9 = {
    "Student": ["Ariel", "Ariel", "Devin", "Mary"],
    "Course ID": [101, 102, 101, 103],
    "Score": [79.2, 92.1, 85.0, 90.0]
}
df_q9 = pd.DataFrame(data_q9)
df_q9["Student"] = df_q9["Student"].astype("string")

display(df_q9)
display(df_q9.dtypes)

  Student  Course ID  Score
0   Ariel        101   79.2
1   Ariel        102   92.1
2   Devin        101   85.0
3    Mary        103   90.0

Student      string[python]
Course ID             int64
Score               float64
dtype: object

Transpose the dataframe. What are the dtypes of each transposed column?

In [2]:
dft_q9 = df_q9.transpose()
display(dft_q9)
display(dft_q9.dtypes)

               0      1      2     3
Student    Ariel  Ariel  Devin  Mary
Course ID    101    102    101   103
Score       79.2   92.1   85.0  90.0

0    object
1    object
2    object
3    object
dtype: object

If we transpose the dataframe again, would we get back the original dataframe? Explain.

In [3]:
dftt_q9 = df_q9.transpose().transpose()
display(dftt_q9)
display(dftt_q9.dtypes)

  Student Course ID Score
0   Ariel       101  79.2
1   Ariel       102  92.1
2   Devin       101  85.0
3    Mary       103  90.0

Student      object
Course ID    object
Score        object
dtype: object

# Section III. Pivoting and Unpivoting

## Question 11

**_Pivoting._** Write a Pandas expression to reshape the following table such that its columns are the 3
types of metals in the `CType` column, and whose values are taken from the `USD` column. Also write the
resulting table.

In [5]:
data_q11 = {
    'Item': ['Item0', 'Item0', 'Item1', 'Item1'],
    'CType': ['Gold', 'Bronze', 'Gold', 'Silver'],
    'USD': ['$1', '$2', '$3', '$4'],
    'EUR': ['€1', '€2', '€3', '€4']
}
df_q11  = pd.DataFrame(data_q11)
df_q11

    Item   CType USD EUR
0  Item0    Gold  $1  €1
1  Item0  Bronze  $2  €2
2  Item1    Gold  $3  €3
3  Item1  Silver  $4  €4

In [7]:
df_q11.pivot(columns = 'CType', values = 'USD', index = 'Item')

CType Bronze Gold Silver
Item
Item0     $2   $1    NaN
Item1    NaN   $3     $4

## Question 12

**_Unpivoting._** Write a Pandas expression to reshape the following table from a _wide_ shape into a long shape, using the student and school columns as identifiers, and the rest of the subjects as variables.
Also write the resulting table. Hint: `use df.melt()`.

In [8]:
data_q12 = {
    'student': ['Andy', 'Bernie', 'Cindy', 'Deb'],
    'school': ['Z', 'Y', 'Z', 'Y'],
    'english': [90, 100, 60, 150],
    'math': [60, 5, 99, 4],
    'physics': [80, 4, 100, 5]
}

df_q12 = pd.DataFrame(data_q12)
df_q12

  student school  english  math  physics
0    Andy      Z       90    60       80
1  Bernie      Y      100     5        4
2   Cindy      Z       60    99      100
3     Deb      Y      150     4        5

In [12]:
# Write your code here
df_q12.melt(id_vars= ['student', 'school']) #Same thing as staff solution just not w/ relabeled columns

   student school variable  value
0     Andy      Z  english     90
1   Bernie      Y  english    100
2    Cindy      Z  english     60
3      Deb      Y  english    150
4     Andy      Z     math     60
5   Bernie      Y     math      5
6    Cindy      Z     math     99
7      Deb      Y     math      4
8     Andy      Z  physics     80
9   Bernie      Y  physics      4
10   Cindy      Z  physics    100
11     Deb      Y  physics      5

In [14]:
#Staff Solution
df_q12.melt(id_vars=["student", "school"], value_vars=["english", "math", "physics"], var_name = "Subject", value_name="Score")

   student school  Subject  Score
0     Andy      Z  english     90
1   Bernie      Y  english    100
2    Cindy      Z  english     60
3      Deb      Y  english    150
4     Andy      Z     math     60
5   Bernie      Y     math      5
6    Cindy      Z     math     99
7      Deb      Y     math      4
8     Andy      Z  physics     80
9   Bernie      Y  physics      4
10   Cindy      Z  physics    100
11     Deb      Y  physics      5

In [8]:
#Command line tools from lecture

!du -h disc05.ipynb #disk size of fname in human-readable format
!ls -lh disc05.ipynb # list with details (owner, size, date mod.)
!head disc05.ipynb #show the first 10 lines of file

28K	disc05.ipynb
-rw-r--r-- 1 jovyan jovyan 26K Oct  3 00:49 disc05.ipynb
{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "83984490-f05e-4a23-bcba-8f4ee21e524d",
   "metadata": {},
   "source": [
    "# Discussion 05 Notebook\n",
    "\n",
    "This notebook is an accompaniment to the associated discussion worksheet handout."